{
  "name": "James Njoroge",
  "sections":{
    "about": "About",
    "workExperience": "Work Experience",
    "education": "Education",
    "skills": "Skills",
    "projects": "Projects"
  },
  "about": "Student Software and Data Engineer",
  "summary": "I am an ambitious, diligent, and analytical student leader with a portfolio in software development, data analytics, and research, exemplified by outstanding academic performance and co-founding a student-run tech startup at Colgate University.",
  "education": {
    "bachelor": {
      "school": "Colgate Univiersity",
      "major": "Computer Science | Applied Mathematics"
    },
    "abroad": {
      "school": "University of Manchester (Study Abroad)",
      "classes": "Artificial Intelligence | Probability | Database Systems"
    },
    "highSchool": {
      "school": "Choate Rosemary Hall",
      "degree": "High School Diploma"
    }
  },
  "work": {
    "colgate-ta" : {
      "title": "Teaching Assistant",
      "description": {
        "1": "Develop and maintain strong and trustworthy relationships with professors and students to provide academic support and reinforcement.",
        "2": "Assist students with homework and lab assignments in Python and Java Programming languages.",
        "3": "Guide and debug students' work to strengthen their understanding of computer science concepts.",
        "4": "Provide one-on-one tutoring and serve as mentor for introductory Python/Java courses, and the Data Structures and Algorithms course."
      }
    },
    "colgate-research" : {
      "title": "Research Intern",
      "description": {
        "1": "Developed and maintained R Shiny applications for advanced statistical analysis of geospatial data, social networks, and textual corpora.",
        "2": "Collaborated with researchers on ongoing projects, utilizing R Shiny applications to evaluate hypotheses and extract insights from complex datasets.",
        "3": "Created user-friendly interfaces using R Shiny, making powerful R-based analyses accessible to diverse users without extensive programming knowledge.",
        "4": "Improved data science accessibility at Colgate University by creating interdisciplinary tools that bridge statistical modelling and researchers from diverse disciplines."
      }
    },
    "colgate-econ" : {
      "title": "Survey and Research Analytics Assistant",
      "description": {
        "1": "Conducted economic research on domestic violence and its effect on agricultural economics in Western Kenya.",
        "2": "Collaborated with professor to acquire and clean collected survey data using Microsoft Excel.",
        "3": "Examined research data for trends and anomalies in collaboration with a colleague, thus reducing the margin of error produced by the data.",
        "4": "Translated qualitative survey data from Swahili to English for easier analysis.",
        "5": "Supervised data collection and reviewed quality of collected data through field work.",
        "6": "Evaluated research and survey-taking methods, and recommended bias-reduction techniques."
      }
    },
    "colgate-its" : {
      "title": "IT Consultant",
      "description": {
        "1": "Work in a customer-facing role on the phone and in-person.",
        "2": "Assist the campus community in the usage of technology on campus, including multi-factor authentication, Office 365 Apps, Adobe Software, and Google software.",
        "3": "Write detailed trouble tickets for users who have issues that need to be escalated to other departments.",
        "4": "Use Salesforce software to provide support and solutions to affected students, faculty, and staff in various departments.",
        "5": "Collaborate with a diverse team in a fast-paced atmosphere."
      }
    },
    "marketing-africa": {
      "title": "Marketing Intern",
      "description": {
        "1": "Worked within the sales team, selling our services and calling potential leads for attendance at the Marketer's Night in Nairobi and Marketer's Quiznite all over Kenya.",
        "2": "Used Excel and mail analytics to manage and execute the distribution of the Marketing Africa magazine all over Kenya.",
        "3": "Amalgamated the client database from various social media platforms using Microsoft Excel so as to broaden the reach of the company.",
        "4": "Collaborated with colleagues to ensure full customer satisfaction in the advertisement sector of the company."
      }
    },
    "tecfenix": {
      "title": "Software Engineer", 
      "description":{
        "1": "Achieved a 20% throughput improvement by migrating a backend API from .NET Framework to .NET Core 1.1."
      }
    }
  },
  "projects": {
    "blog": {
      "title": "jsantanders.dev",
      "description": "My personal website and blog. Built with Next.js and MDX"
    },
    "learning": {
      "title": "learning.jsantanders.dev",
      "description": "Solutions to problems found in books I’m reading"
    },
    "ddd": {
      "title": "modular-monolith-nestjs",
      "description": "A Modular Monolith application with Domain-Driven Design approach. Using NestJS as a backend framework."
    }
  },
  "present": "Present",
  "seeMore": "See more",
  "seeLess": "See less"
}